runs/1790754360/case/constant/turbulenceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties;
}
simulationType RAS;
RAS { model kOmegaSST; turbulence on; printCoeffs on; }
